{
    "id": 142,
    "description": "Given the array orders, which represents the orders that customers have done in a restaurant. More specifically *orders[i]=[customerNamei,tableNumberi,foodItemi]* where *customerNamei* is the name of the customer, *tableNumberi* is the table customer sit at, and *foodItemi* is the item customer orders.\n\nPrint the restaurant's “display table”. The “display table” is a table whose row entries denote how many of each food item each table ordered. The first column is the table number and the remaining columns correspond to each food item in alphabetical order. The first row should be a header whose first column is “Table”, followed by the names of the food items. Note that the customer names are not part of the table. Additionally, the rows should be sorted in numerically increasing order.\n\n#### Input Format:\n* first line contains a single integer n (total number of orders)\n* next n lines contains 3 strings customer name, table number and food item respectively.\n\n#### Output Format:\n* print the 2D string matrix which shows the food item in column and table number in rows. intersection of row and column shows the number of that fooditem odered on that table number.\n\n#### Conatraints:\n* 1 <= orders.length <= 5 * 10^4\n* orders[i].length == 3\n* 1 <= customerNamei.length, foodItemi.length <= 20\n* customerNamei and foodItemi consist of lowercase and uppercase English letters and the space character.\n* tableNumberi is a valid integer between 1 and 500.\n\n#### Example:\n**Input**: 6\nDavid 3 Ceviche\nCorina 10 Beef Burrito\nDavid 3 Fried Chicken\nCarla 5 Water\nCarla 5 Ceviche\nRous 3 Ceviche\n**Output**: \nTable Beef Burrito Ceviche Fried Chicken Water\n3 0 2 1 0\n5 0 1 0 1\n10 1 0 0 0 \n**Explanation**:\n- The displaying table looks like:\nTable, Beef Burrito, Ceviche, Fried Chicken, Water\n3         ,0                     ,2             , 1                         , 0\n5         ,0                     ,1              , 0                        , 1\n10        ,1                     ,0             , 0                        , 0\n\n- For the table 3: David orders \"Ceviche\" and \"Fried Chicken\", and Rous orders \"Ceviche\".\n- For the table 5: Carla orders \"Water\" and \"Ceviche\".\n- For the table 10: Corina orders \"Beef Burrito\".",
    "title": "Display Table of Food Orders in a Restaurant",
    "default_testcase": null,
    "problem_type": "practice",
    "code_skeletons": []
}