{
    "id": 746,
    "description": "There is a ship which transports tourists to different cities. The distance of docks are represented in the form of a number line where the first dock lies at 0 and then the other docks are located at different distances from there, for example let us say there are three docks then they will be represented as [0 1 7], where the distance between the two docks located at index x and y is given as |a[x] - a[y]|. A dock is considered to be close to another dock if and only if the distance between the two dock is the minimum compared to the distance from other docks. For example consider this array of docks on number line.\n\ndocks = [0 3 4 9 10]\n\nThen the dock closest to dock[0] is dock[1] and for the dock[1] it would be dock[2].\n\n* Note : the inputs are given in such a way that there exists only one dock which is closest to another dock, for example: [0 1 2] in this the dock at index 1 is close to both dock at index 0 and index 2, the inputs given will not have docks that have two closest docks.\n\nThere is a cost for ship to travel between docks. If the dock that it is travelling to is close to it's current dock then the cost of travelling is 1, otherwise the cost would be the distance between them. Taking the example array from before let's say you wanted to go from dock[0] to dock[1] then the cost of travelling would be one, but if you wanted to go from dock[0] to dock[2] then the cost would be |dock[0] - dock[2]| = |0-4| = 4.\n\nYou are given q queries and each query contains two integers denoting the starting index of dock and ending index of dock, calculate the total cost of travelling from start to end by the ship for each query.\n\nInput Format:\n\nThe first line contains an integer denoting the total number of docks.\n\nThe second line contains n space separated integers which starts from zero and are in a sorted manner.\n\nThe third line contains a single integer 'q' denoting the number of queries to be resolved.                          \n\nThe fourth line contains two integers denoting the starting index of dock and ending index of dock.\n\nSample Input:\n\n5\n\n0 2 6 9 10\n\n3\n\n0 1\n\n0 4\n\n0 3\n\nSample Output:\n\n1\n\n7\n\n6\n\nConstraints:\n\n2<=n<=10^4\n\n0<=a[i]<=10^4\n\n1<=q<=10^4",
    "title": "Closest Dock",
    "default_testcase": null,
    "problem_type": "practice",
    "code_skeletons": []
}