{
    "id": 870,
    "description": "Daisy is exploring divisibility rules for integers in different numeral bases and wants to determine divisibility rules that preserve remainders in specified bases `b`. These rules are akin to familiar divisibility tests like those for 3, 11, 4, or 7 in base 10 but adapted to other bases and divisors.\n\nThe tests Daisy is interested in fall into three categories:\n1. **Kind 1:** Check divisibility using the last `k` digits of a number in base `b`.\n2. **Kind 2:** Check divisibility using the sum of groups of `k` digits of a number in base `b`.\n3. **Kind 3:** Check divisibility using an alternating sum of groups of `k` digits of a number in base `b`.\n\nDaisy needs to determine the smallest group size `k` for which such a divisibility test exists for given base `b` and modulo `n`.\n\n**Input:**\n- The input starts with an integer `t` (1 ≤ t) representing the number of test cases.\n- Each test case consists of two integers `b` and `n` (b, n ≥ 2) indicating the base and the modulo.\n- The sum of all values for `b` across all tests does not exceed 10^6, and the sum of all values for `n` does not exceed 10^6.\n\n**Output:**\n- For each test case, output the type of divisibility test (`a` where 1 ≤ a ≤ 3) and the smallest group size `k` that allows such a test. If no divisibility test exists for the given base and modulo, output `0`.\n\n**Example:**\n\nInput:\n```\n6\n10 3\n10 11\n10 4\n10 7\n8 5\n10 6\n```\nOutput:\n```\n2 1\n3 1\n1 2\n3 3\n3 2\n0\n```\n\n**Explanation:**\n\n- For base 10 and modulo 3, the sum of digits (base 10) modulo 3 is equivalent to the original number modulo 3. Hence, the rule is of Kind 2 with a group size of 1.\n- For base 10 and modulo 11, the alternating sum of digits (base 10) modulo 11 matches the original number modulo 11. The rule is of Kind 3 with a group size of 1.\n- For base 10 and modulo 4, the last two digits determine divisibility by 4. This is a Kind 1 rule with a group size of 2.\n- For base 8 and modulo 5, the alternating sum of groups of two octal digits modulo 5 corresponds to the original number modulo 5. This is a Kind 3 rule with a group size of 2.\n- For base 10 and modulo 6, no simple divisibility test exists that fits the categories described, hence the output is `0`.\n\n**Task:**\n\nImplement an algorithm that, for each given base and modulo, identifies the optimal divisibility test (if any) according to the specified kinds and determines the smallest group size `k` for such tests.",
    "title": "Base Specific Divisibility Rules",
    "default_testcase": null,
    "problem_type": "practice",
    "code_skeletons": []
}